<a href="https://colab.research.google.com/github/MadhurimaPaul-87/Python-Data-Analysis-and-Visualization-Bootcamp/blob/main/Dropping_entries_in_pandas_series_and_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
#Drop values from series
cars= pd.Series(['BMW','AUDI','MERCEDES'], index=['a','b','c'])
cars

a         BMW
b        AUDI
c    MERCEDES
dtype: object

In [4]:
cars= cars.drop('a')
cars

b        AUDI
c    MERCEDES
dtype: object

In [5]:
#Drop rows from dataframe
#Drop columns from dataframe
cars_df= pd.DataFrame(np.random.randn(9).reshape(3,3),index=['BMW','AUDI','MERCEDES'], columns=['Test1','Test2','Test3'])

In [6]:
cars_df

             Test1     Test2     Test3
BMW       0.768130 -0.135522  1.983646
AUDI     -0.243274  0.378927  1.956058
MERCEDES  0.369106  0.193669  0.608346

In [7]:
cars_df= cars_df.drop('BMW')
cars_df

             Test1     Test2     Test3
AUDI     -0.243274  0.378927  1.956058
MERCEDES  0.369106  0.193669  0.608346

In [8]:
cars_df= cars_df.drop("Test1",axis=1)
cars_df

             Test2     Test3
AUDI      0.378927  1.956058
MERCEDES  0.193669  0.608346